In [ ]:
fruits = ['apple', 'banana', 'cherry']
for x in fruits:   # no condition
    print(x)   # apple, banana
    if x == 'banana'
    break

In [ ]:
fruits = ['apple', 'banana']

# Note that range (6) is not the values of 0 to 6, but the values 0 to 5

In [1]:
for x in range(5):   # n=5, range= n-1 = 5-1=4
    print(x)

0
1
2
3
4

# Else in for loop
The else keyword in a for loop specifies a

# Nested Loops
A nested doop is a loop inside a loop.
The "Inner loop" will be executed one time for each iteration of the "outer loop"

In [3]:
adj = ['red', 'big', 'tasty']
fruits = ['apple', 'banana', 'cherry']

for x in adj:   # re,big,tasty
    for y in fruits:   # apple, banana, cherry
        if y == 'apple' :
            print ('Valid')
        else:
            print('Invalid')
else:
    print('Outer Invalid')

Valid
Invalid
Invalid
Valid
Invalid
Invalid
Valid
Invalid
Invalid
Outer Invalid

# Lambda Function

In [4]:
def abc(x):
    output= x*2
    return output

In [5]:
abc(2)

4

In [7]:
# Program to show the use of Lambda functions
double = lambda x: x*2

print(double(6))

12

In [9]:
list_1 = [1,2,3,4,5,6,7,8,9]   # array
list(filter(lambda x: x%2==0, list_1))

[2, 4, 6, 8]

In [10]:
list_2 = [1,2,3,4,5,6,7,8,9]  # array
list(filter(lambda x: x%2==1, list_2))

[1, 3, 5, 7, 9]

In [11]:
list_1 = [1,2,3,4,5,6,7,8,9]
sqr = map(lambda x: pow(x,2), list_1)
list(sqr)

[1, 4, 9, 16, 25, 36, 49, 64, 81]

In [12]:
list_1 = [1,2,3,4,5,6,7,8,9]
cubed = map(lambda x: pow(x,3), list_1)
list(cubed)

[1, 8, 27, 64, 125, 216, 343, 512, 729]

In [16]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Luke', 'Gina', 'Sam', 'Emma'],
    'Status': ['Father', 'Mother', 'Son', 'Daughter'],
    'Birthyear': [1976, 1984, 2013, 2016]
})
df

   Name    Status  Birthyear
0  Luke    Father       1976
1  Gina    Mother       1984
2   Sam       Son       2013
3  Emma  Daughter       2016

In [17]:
df['age'] = df['Birthyear'].apply(lambda x: 2022-x)   # x=birthyear
df

   Name    Status  Birthyear  age
0  Luke    Father       1976   46
1  Gina    Mother       1984   38
2   Sam       Son       2013    9
3  Emma  Daughter       2016    6

In [18]:
list(filter(lambda x: x>10, df['age']))

[46, 38]

In [19]:
df['double_age'] = df['age'].map(lambda x: x*2)
df

   Name    Status  Birthyear  age  double_age
0  Luke    Father       1976   46          92
1  Gina    Mother       1984   38          76
2   Sam       Son       2013    9          18
3  Emma  Daughter       2016    6          12

In [20]:
# conditional lambda statement
df['Gender'] = df['Status'].map(lambda x: 'Male' if x=='Father' or x=='Son' else 'Female')
df

   Name    Status  Birthyear  age  double_age  Gender
0  Luke    Father       1976   46          92    Male
1  Gina    Mother       1984   38          76  Female
2   Sam       Son       2013    9          18    Male
3  Emma  Daughter       2016    6          12  Female

In [22]:
# convert to Lower-case
df[['Name', 'Status']]= df.apply(lambda x: x[['Name', 'Status']]. str.lower(), axis=1)
df

   Name    Status  Birthyear  age  double_age  Gender
0  luke    father       1976   46          92    Male
1  gina    mother       1984   38          76  Female
2   sam       son       2013    9          18    Male
3  emma  daughter       2016    6          12  Female